app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
	@booknew = Book.new
	@book = Book.find(params[:id])

SELECT "books".* FROM "books"
---
  def index
	@book = Book.new
	  @books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asd"], ["body", "asd"], ["user_id", 2], ["created_at", "2020-03-03 10:16:32.275868"], ["updated_at", "2020-03-03 10:16:32.275868"]]
SELECT "books".* FROM "books"
---
  def create
	  @book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
	  @book.user_id = current_user.id
	if @book.save #入力されたデータをdbに保存する。
	   flash[:notice] = "successfully created book!"
       redirect_to book_path(@book) #保存された場合の移動先を指定。
  	else
		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "村田沙耶香です"], ["updated_at", "2020-03-04 08:43:15.220126"], ["id", 2]]
---
  def update
	  @book = Book.find(params[:id])
	  @book.user_id = current_user.id
	if @book.update(book_params)