app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @comment = current_user.book_comments.new(book_comment_params)
    @comment.book_id = @book.id
    if @comment.save
    @comment.save
    redirect_back(fallback_location: root_path)
    else
      @booknew = Book.new
	    @book_comment = BookComment.new
      @bookcomments = BookComment.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaa"], ["user_id", 1], ["book_id", 10], ["created_at", "2020-03-08 10:15:18.738862"], ["updated_at", "2020-03-08 10:15:18.738862"]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaaa"], ["user_id", 1], ["book_id", 4], ["created_at", "2020-03-08 08:58:04.413308"], ["updated_at", "2020-03-08 08:58:04.413308"]]
SELECT "book_comments".* FROM "book_comments"

  def destroy
    @book = Book.find(params[:book_id])
    # binding.pry
    @comment = BookComment.find(params[:id])
    # @comment.user_id == current_user.id
      # if
         @comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? AND "book_comments"."id" = ? LIMIT ?  [["book_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]