app/controllers/users_controller.rb

  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。
---
SELECT "users".* FROM "users"

  def update
	  @user = User.find(params[:id])
	  @user.id = current_user.id
	  if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", "fd4f36a0a8f2632a6cbceee6f353fb3c5fb5414157e4bbefb3da24880bf7"], ["updated_at", "2020-03-08 06:45:38.206154"], ["id", 1]]

   def corrent_user
	user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]